In [9]:
import mysql.connector
db=mysql.connector.connect(
    host="127.0.0.1",
    user="root",
    password="1234",
    auth_plugin='mysql_native_password',
    database="testdatabase"

)
mycursor=db.cursor()
mycursor.execute("CREATE DATABASE IF NOT EXISTS mydatabase")
mycursor.execute('show tables')
for x in mycursor:
    print(x)

In [12]:
mycursor.execute('''
    CREATE TABLE IF NOT EXISTS dept (
        dept_id INT,
        dept_name VARCHAR(20),
        faculty VARCHAR(30),
        no_of_student INT,
        PRIMARY KEY(dept_id)
    )
''')

mycursor.execute('''
    CREATE TABLE IF NOT EXISTS course (
        course_no VARCHAR(20),
        course_name VARCHAR(50),
        year_semester INT,
        credit DECIMAL(20,4),
        dept_id INT,
        PRIMARY KEY(course_no),
        FOREIGN KEY(dept_id) REFERENCES dept(dept_id)
    )
''')

mycursor.execute('''
    CREATE TABLE IF NOT EXISTS book (
        book_no INT,
        book_name VARCHAR(50),
        author VARCHAR(50),
        book_edition INT,
        course_offering INT,
        PRIMARY KEY(book_no)
    )
''')

mycursor.execute('''
    CREATE TABLE IF NOT EXISTS relation (
        book_no INT,
        course_no VARCHAR(20),
        PRIMARY KEY(book_no, course_no),
        FOREIGN KEY(book_no) REFERENCES book(book_no),
        FOREIGN KEY(course_no) REFERENCES course(course_no)
    )
''')

In [ ]:
# mycursor.execute('drop table dept')

In [16]:
# execute alter table command
mycursor.execute("ALTER TABLE dept ADD location CHAR(20)")
# modify column data type
mycursor.execute("ALTER TABLE dept MODIFY location VARCHAR(23)")
# rename column
mycursor.execute("ALTER TABLE dept RENAME COLUMN location TO location2")
# drop column
mycursor.execute("ALTER TABLE dept DROP COLUMN location2")

In [ ]:
mycursor.execute("INSERT INTO dept (dept_id, dept_name, faculty, no_of_student) VALUES (7, 'CSE', 'EE', 120)")
mycursor.execute("INSERT INTO dept (dept_id, dept_name, faculty, no_of_student) VALUES (3, 'EEE', 'EE', 120)")
mycursor.execute("INSERT INTO dept (dept_id, dept_name, faculty, no_of_student) VALUES (1, 'CE', 'CE', 120)")
mycursor.execute("INSERT INTO dept (dept_id, dept_name, faculty, no_of_student) VALUES (5, 'ME', 'ME', 120)")
mycursor.execute("INSERT INTO dept (dept_id, dept_name, faculty, no_of_student) VALUES (2, 'ECE', 'EE', 60)")

In [20]:
mycursor.execute("INSERT INTO course (course_no, course_name, year_semester, credit, dept_id) VALUES ('CSE1101', 'discreate math', 11, 3.00, 7)")
mycursor.execute("INSERT INTO course (course_no, course_name, year_semester, credit, dept_id) VALUES ('CSE3105', 'database systems', 31, 3.00, 7)")
mycursor.execute("INSERT INTO course (course_no, course_name, year_semester, credit, dept_id) VALUES ('EEE1101', 'Basic electrical engineering', 11, 3.00, 3)")
mycursor.execute("INSERT INTO course (course_no, course_name, year_semester, credit, dept_id) VALUES ('ME3101', 'solid mechanics', 31, 3.00, 5)")

mycursor.execute("INSERT INTO book (book_no, book_name, author, book_edition, course_offering) VALUES (12, 'discreate math', 'rosen', 4, 2)")
mycursor.execute("INSERT INTO book (book_no, book_name, author, book_edition, course_offering) VALUES (13, 'database systems', 'korth', 5, 1)")
mycursor.execute("INSERT INTO book (book_no, book_name, author, book_edition, course_offering) VALUES (14, 'data_communication', 'willim stallings', 6, 3)")
mycursor.execute("INSERT INTO book (book_no, book_name, author, book_edition, course_offering) VALUES (15, 'solid mechanics', 'john abraham', 3, 2)")
mycursor.execute("INSERT INTO book (book_no, book_name, author, book_edition, course_offering) VALUES (16, 'electrical engineering', 'boylsted', 8, 4)")

mycursor.execute("INSERT INTO relation (book_no, course_no) VALUES (12, 'CSE1101')")
mycursor.execute("INSERT INTO relation (book_no, course_no) VALUES (16, 'EEE1101')")
mycursor.execute("INSERT INTO relation (book_no, course_no) VALUES (15, 'ME3101')")
mycursor.execute("INSERT INTO relation (book_no, course_no) VALUES (13, 'CSE3105')")

In [21]:
mycursor.execute("SELECT * FROM dept WHERE no_of_student=120")
result = mycursor.fetchall()
for row in result:
  print(row)

(1, 'CE', 'CE', 120)
(3, 'EEE', 'EE', 120)
(5, 'ME', 'ME', 120)
(7, 'CSE', 'EE', 120)

In [22]:
# execute command
mycursor.execute("SELECT * FROM dept WHERE dept_id=(SELECT dept_id FROM course WHERE course_name='database systems')")

# fetch result
result = mycursor.fetchall()

# print result
for x in result:
  print(x)

(7, 'CSE', 'EE', 120)

In [23]:
mycursor.execute("UPDATE course SET course_name='Digital Electronics' WHERE course_no='EEE1101'")

In [24]:
mycursor.execute("INSERT INTO dept (dept_id, dept_name, faculty, no_of_student) VALUES (12, 'URP', 'CE', 60)")

mycursor.execute("DELETE FROM dept WHERE dept_id = 12")

In [25]:
mycursor.execute("SELECT dept_name FROM dept WHERE dept_name LIKE 'E%' UNION SELECT dept_name FROM dept WHERE dept_name LIKE '%M%'")

# fetch results
result = mycursor.fetchall()

# print results
for x in result:
  print(x)

('ECE',)
('EEE',)
('ME',)

In [26]:
# execute SQL commands
mycursor.execute("SELECT COUNT(*) FROM dept")
result = mycursor.fetchone()
print(result)

mycursor.execute("SELECT COUNT(dept_name) AS number_of_dept FROM dept")
result = mycursor.fetchone()
print(result)

mycursor.execute("SELECT COUNT(DISTINCT dept_name) AS number_of_dept FROM dept")
result = mycursor.fetchone()
print(result)

mycursor.execute("SELECT AVG(no_of_student) FROM dept")
result = mycursor.fetchone()
print(result)

mycursor.execute("SELECT SUM(no_of_student) FROM dept")
result = mycursor.fetchone()
print(result)

mycursor.execute("SELECT MAX(no_of_student) FROM dept")
result = mycursor.fetchone()
print(result)

mycursor.execute("SELECT MIN(no_of_student) FROM dept")
result = mycursor.fetchone()
print(result)

mycursor.execute("SELECT faculty, AVG(no_of_student) FROM dept GROUP BY faculty")
result = mycursor.fetchall()
for row in result:
    print(row)

mycursor.execute("SELECT faculty, AVG(no_of_student) FROM dept GROUP BY faculty HAVING AVG(no_of_student) > 60")
result = mycursor.fetchall()
for row in result:
    print(row)

(5,)
(5,)
(5,)
(Decimal('108.0000'),)
(Decimal('540'),)
(120,)
(60,)
('CE', Decimal('120.0000'))
('EE', Decimal('100.0000'))
('ME', Decimal('120.0000'))
('CE', Decimal('120.0000'))
('EE', Decimal('100.0000'))
('ME', Decimal('120.0000'))

In [28]:
mycursor.execute("CREATE TABLE test (name VARCHAR(255))")

# insert the data
data = ["EEE", "CSE", "BME", "ECE", "MSE", "URP", "ME", "CIVIL", "ECEC", "EE"]
for name in data:
    sql = "INSERT INTO test (name) VALUES (%s)"
    val = (name,)
    mycursor.execute(sql, val)

In [29]:
# execute the commands
mycursor.execute("SELECT * FROM TEST WHERE NAME LIKE 'E%'")
result = mycursor.fetchall()
for row in result:
  print(row)

mycursor.execute("SELECT * FROM TEST WHERE NAME LIKE '%E'")
result = mycursor.fetchall()
for row in result:
  print(row)

mycursor.execute("SELECT * FROM TEST WHERE NAME LIKE '%E%E%'")
result = mycursor.fetchall()
for row in result:
  print(row)

mycursor.execute("SELECT * FROM TEST WHERE NAME LIKE '___'")
result = mycursor.fetchall()
for row in result:
  print(row)

mycursor.execute("SELECT * FROM TEST WHERE NAME LIKE '___' or NAME LIKE '____' or NAME LIKE '_____'")
result = mycursor.fetchall()
for row in result:
  print(row)

('EEE',)
('ECE',)
('ECEC',)
('EE',)
('EEE',)
('CSE',)
('BME',)
('ECE',)
('MSE',)
('ME',)
('EE',)
('EEE',)
('ECE',)
('ECEC',)
('EE',)
('EEE',)
('CSE',)
('BME',)
('ECE',)
('MSE',)
('URP',)
('EEE',)
('CSE',)
('BME',)
('ECE',)
('MSE',)
('URP',)
('CIVIL',)
('ECEC',)

In [31]:
# perform join operations
mycursor.execute("SELECT * FROM dept NATURAL JOIN course WHERE dept_id=7")
result = mycursor.fetchall()
for row in result:
    print(row)

mycursor.execute("SELECT * FROM dept NATURAL JOIN course")
result = mycursor.fetchall()
for row in result:
    print(row)

mycursor.execute("SELECT dept_name, course_name FROM dept JOIN course USING(dept_id)")
result = mycursor.fetchall()
for row in result:
    print(row)

mycursor.execute("SELECT dept_name, course_name FROM dept JOIN course ON dept.dept_id=course.dept_id")
result = mycursor.fetchall()
for row in result:
    print(row)

mycursor.execute("SELECT dept_name, course_name FROM dept LEFT OUTER JOIN course USING(dept_id)")
result = mycursor.fetchall()
for row in result:
    print(row)

mycursor.execute("SELECT dept_name, course_name FROM dept RIGHT OUTER JOIN course USING(dept_id)")
result = mycursor.fetchall()
for row in result:
    print(row)

mycursor.execute("SELECT dept_name, course_name FROM dept LEFT OUTER JOIN course ON dept.dept_id=course.dept_id UNION SELECT dept_name, course_name FROM dept RIGHT OUTER JOIN course ON dept.dept_id=course.dept_id WHERE dept.dept_id IS NULL")
result = mycursor.fetchall()
for row in result:
    print(row)

(7, 'CSE', 'EE', 120, 'CSE1101', 'discreate math', 11, Decimal('3.0000'))
(7, 'CSE', 'EE', 120, 'CSE3105', 'database systems', 31, Decimal('3.0000'))
(7, 'CSE', 'EE', 120, 'CSE1101', 'discreate math', 11, Decimal('3.0000'))
(7, 'CSE', 'EE', 120, 'CSE3105', 'database systems', 31, Decimal('3.0000'))
(3, 'EEE', 'EE', 120, 'EEE1101', 'Digital Electronics', 11, Decimal('3.0000'))
(5, 'ME', 'ME', 120, 'ME3101', 'solid mechanics', 31, Decimal('3.0000'))
('CSE', 'discreate math')
('CSE', 'database systems')
('EEE', 'Digital Electronics')
('ME', 'solid mechanics')
('CSE', 'discreate math')
('CSE', 'database systems')
('EEE', 'Digital Electronics')
('ME', 'solid mechanics')
('CE', None)
('ECE', None)
('EEE', 'Digital Electronics')
('ME', 'solid mechanics')
('CSE', 'discreate math')
('CSE', 'database systems')
('CSE', 'discreate math')
('CSE', 'database systems')
('EEE', 'Digital Electronics')
('ME', 'solid mechanics')
('CE', None)
('ECE', None)
('EEE', 'Digital Electronics')
('ME', 'solid mechanics')
('CSE', 'database systems')
('CSE', 'discreate math')

In [35]:
mycursor.execute("SHOW CREATE VIEW dept_details")
result = mycursor.fetchone()
if result:
    mycursor.execute("DROP VIEW dept_details")
    mycursor.execute("CREATE VIEW dept_details AS SELECT dept_id, dept_name FROM dept")

mycursor.execute("SHOW CREATE VIEW CSE_DEPT_COURSE")
result = mycursor.fetchone()
if result:
    mycursor.execute("DROP VIEW CSE_DEPT_COURSE")
    mycursor.execute("CREATE VIEW CSE_DEPT_COURSE AS SELECT course_name FROM course WHERE dept_id=(SELECT dept_id FROM dept WHERE dept_name='CSE')")

mycursor.execute("SHOW CREATE VIEW custom")
result = mycursor.fetchone()
if result:
    mycursor.execute("DROP VIEW custom")
    mycursor.execute("CREATE VIEW custom AS SELECT * FROM dept_details WHERE dept_id>=3")

In [ ]:
db.commit()
mycursor.close()
db.close()